app/Models/loginuser.php

SELECT *
FROM `tb_user`
WHERE `email` = 'salma@gmail.com'
AND `password` = 'salma123'
---
public function loginUser($email, $password)
{
    return $this->db->table('tb_user')
    ->where([
        'email' => $email,
        'password' => $password,
    ])->get()->getRowArray();