app/Models/modelPenerbit.php

    public function AllData()
   {
        return $this->db->table('tb_penerbit')
        ->orderBy('id','DESC')
        ->Get()->getResultArray();
---
SELECT *
FROM `tb_penerbit`
ORDER BY `id` DESC

   public function Add($data)
   {
    $this->db->table('tb_penerbit')->insert($data);
---
INSERT INTO `tb_penerbit` (`nama`, `alamat`, `telp`) VALUES ('abin', 'kanggraksan', '09876543')