app/Models/modelPenulis.php

    public function AllData()
   {
        return $this->db->table('tb_penulis')
        ->orderBy('id','DESC')
        ->Get()->getResultArray();
---
SELECT *
FROM `tb_penulis`
ORDER BY `id` DESC

   public function UpdateData($data)
   {
    $this->db->table('tb_penulis')
    ->where('id',$data['id'])
    ->update($data);
---
UPDATE `tb_penulis` SET `id` = '4', `nama` = 'salma', `alamat` = 'talun', `website` = 'sjhs'
WHERE `id` = '4'